# IsBodyConnectorLocked Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConnectorInfo..::..IsBodyConnectorLocked Property
FabricationConnectorInfo Class See Also
---
Fabrication body connector lock.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsBodyConnectorLocked { get; set; }
```

Visual Basic
---
```text
Public Property IsBodyConnectorLocked As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsBodyConnectorLocked {
	bool get ();
	void set (bool value);
}
```

# Remarks
If set this prevents the connector value being overridden by the fabrication specification.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: the connector cannot be modified on an owned fabrication part. -or- When setting this property: the connector is already connected. -or- When setting this property: the fabrication part is connected to more than one item. |

# See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace